<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class CitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('cities')->insert([

            // ==== 2. Андижанская область  ====
            ['region_id' => 2, 'name' => 'Асакинский р-н'],
            ['region_id' => 2, 'name' => 'г.Андижан'],
            ['region_id' => 2, 'name' => 'г.Ханабад'],
            ['region_id' => 2, 'name' => 'Андижанский р-н'],
            ['region_id' => 2, 'name' => 'Балыкчинский р-н'],
            ['region_id' => 2, 'name' => 'Булакбашинский р-н'],
            ['region_id' => 2, 'name' => 'Бозский р-н'],
            ['region_id' => 2, 'name' => 'Джалалкудукский р-н'],
            ['region_id' => 2, 'name' => 'Избасканский р-н'],
            ['region_id' => 2, 'name' => 'Улугнорский р-н'],
            ['region_id' => 2, 'name' => 'Мархаматский р-н'],
            ['region_id' => 2, 'name' => 'Пахтаабадский р-н'],
            ['region_id' => 2, 'name' => 'Ходжаабадский р-н'],
            ['region_id' => 2, 'name' => 'Алтынкульский р-н'],
            ['region_id' => 2, 'name' => 'Кургантепинский р-н'],
            ['region_id' => 2, 'name' => 'Шахриханский р-н'],

            // ==== 3. Наманганская область   ====
            ['region_id' => 3, 'name' => 'Папский р-н'],
            ['region_id' => 3, 'name' => 'г.Наманган'],
            ['region_id' => 3, 'name' => 'Мингбулакский р-н'],
            ['region_id' => 3, 'name' => 'Касансайский р-н'],
            ['region_id' => 3, 'name' => 'Наманганский р-н'],
            ['region_id' => 3, 'name' => 'Нарынский р-н'],
            ['region_id' => 3, 'name' => 'Туракурганский р-н'],
            ['region_id' => 3, 'name' => 'Уйчинский р-н'],
            ['region_id' => 3, 'name' => 'Учкурганский р-н'],
            ['region_id' => 3, 'name' => 'Чартакский р-н'],
            ['region_id' => 3, 'name' => 'Чустский р-н'],
            ['region_id' => 3, 'name' => 'Янгикурганский р-н'],



            // ==== 4. Хорезмская область    ====
            ['region_id' => 4, 'name' => 'г.Хива'],
            ['region_id' => 4, 'name' => 'г.Ургенч'],
            ['region_id' => 4, 'name' => 'Багатский р-н'],
            ['region_id' => 4, 'name' => 'Ургенчский р-н'],
            ['region_id' => 4, 'name' => 'Кушкупырский р-н'],
            ['region_id' => 4, 'name' => 'Ханкинский р-н'],
            ['region_id' => 4, 'name' => 'Янгиарыкский р-н'],
            ['region_id' => 4, 'name' => 'Хивинский р-н'],
            ['region_id' => 4, 'name' => 'Янгибазарский р-н'],
            ['region_id' => 4, 'name' => 'Хазараспский р-н'],
            ['region_id' => 4, 'name' => 'Шаватский р-н'],
            ['region_id' => 4, 'name' => 'Гурленский р-н'],
            ['region_id' => 4, 'name' => 'Тупраккалинский р-н'],

            // ==== 5. Ташкентская область    ====
            ['region_id' => 5, 'name' => 'Ташкентский р-н'],
            ['region_id' => 5, 'name' => 'г.Янгийуль'],
            ['region_id' => 5, 'name' => 'г.Ахангаран'],
            ['region_id' => 5, 'name' => 'г.Нурафшон'],
            ['region_id' => 5, 'name' => 'г.Ангрен'],
            ['region_id' => 5, 'name' => 'г.Бекабад'],
            ['region_id' => 5, 'name' => 'г.Алмалык'],
            ['region_id' => 5, 'name' => 'г.Чирчик'],
            ['region_id' => 5, 'name' => 'Бекабадский р-н'],
            ['region_id' => 5, 'name' => 'Бостанлыкский р-н'],
            ['region_id' => 5, 'name' => 'Кибрайский р-н'],
            ['region_id' => 5, 'name' => 'Зангиатинский р-н'],
            ['region_id' => 5, 'name' => 'Куйи-чирчикский р-н'],
            ['region_id' => 5, 'name' => 'Аккурганский р-н'],
            ['region_id' => 5, 'name' => 'Паркентский р-н'],
            ['region_id' => 5, 'name' => 'Урта-чирчикский р-н'],
            ['region_id' => 5, 'name' => 'Чиназский р-н'],
            ['region_id' => 5, 'name' => 'Юкори чирчикский р-н'],
            ['region_id' => 5, 'name' => 'Букинский р-н'],
            ['region_id' => 5, 'name' => 'Янгийульский р-н'],
            ['region_id' => 5, 'name' => 'Ахангаранский р-н'],
            ['region_id' => 5, 'name' => 'Пскентский р-н'],


            // ==== 6. 	город Ташкент    ====
            ['region_id' => 6, 'name' => 'Бектемирский р-н'],
            ['region_id' => 6, 'name' => 'Мирабадский р-н'],
            ['region_id' => 6, 'name' => 'М.Улугбекский р-н'],
            ['region_id' => 6, 'name' => 'Сергелийский р-н'],
            ['region_id' => 6, 'name' => 'Алмазарский р-н'],
            ['region_id' => 6, 'name' => 'Учтепинский р-н'],
            ['region_id' => 6, 'name' => 'Яшнабадский р-н'],
            ['region_id' => 6, 'name' => 'Чилонзарский р-н'],
            ['region_id' => 6, 'name' => 'Шайхантахурский р-н'],
            ['region_id' => 6, 'name' => 'Юнусабадский р-н'],
            ['region_id' => 6, 'name' => 'Яккасарайский р-н'],
            ['region_id' => 6, 'name' => 'Янги ҳаётский р-н'],
            ['region_id' => 6, 'name' => 'Яккасарайский р-н'],
            ['region_id' => 6, 'name' => 'Янги ҳаётский р-н'],

            // Bukhara (region_id = 7)
            ['region_id' => 7, 'name' => 'г.Бухара'],
            ['region_id' => 7, 'name' => 'г.Каган'],
            ['region_id' => 7, 'name' => 'Бухарский р-н'],
            ['region_id' => 7, 'name' => 'Вабкентский р-н'],
            ['region_id' => 7, 'name' => 'Джандарский р-н'],
            ['region_id' => 7, 'name' => 'Каганский р-н'],
            ['region_id' => 7, 'name' => 'Алатский р-н'],
            ['region_id' => 7, 'name' => 'Пешкунский р-н'],
            ['region_id' => 7, 'name' => 'Ромитанский р-н'],
            ['region_id' => 7, 'name' => 'Шафирканский р-н'],
            ['region_id' => 7, 'name' => 'Каракульский р-н'],
            ['region_id' => 7, 'name' => 'Караулбазарский р-н'],
            ['region_id' => 7, 'name' => 'Гиждуванский р-н'],

            // Samarkand (region_id = 8)
            ['region_id' => 8, 'name' => 'г.Самарканд'],
            ['region_id' => 8, 'name' => 'Ургутсский р-н'],
            ['region_id' => 8, 'name' => 'Пахтаачинский р-н'],
            ['region_id' => 8, 'name' => 'Каттакурганский р-н'],
            ['region_id' => 8, 'name' => 'Самаркандский р-н'],
            ['region_id' => 8, 'name' => 'Булунгурский р-н'],
            ['region_id' => 8, 'name' => 'Джамбайский р-н'],
            ['region_id' => 8, 'name' => 'Кошрабадский р-н'],
            ['region_id' => 8, 'name' => 'Нарпайский р-н'],
            ['region_id' => 8, 'name' => 'Тайлякский р-н'],
            ['region_id' => 8, 'name' => 'Пастдаргомский р-н'],
            ['region_id' => 8, 'name' => 'Нуробадский р-н'],
            ['region_id' => 8, 'name' => 'г.Каттакурган'],
            ['region_id' => 8, 'name' => 'Пайарыкский р-н'],
            ['region_id' => 8, 'name' => 'Акдарьинский р-н'],
            ['region_id' => 8, 'name' => 'Иштихонский р-н'],

            // Jizzakh (region_id = 9)
            ['region_id' => 9, 'name' => 'Арнасайский р-н'],
            ['region_id' => 9, 'name' => 'Бахмальский р-н'],
            ['region_id' => 9, 'name' => 'Галляаральский р-н'],
            ['region_id' => 9, 'name' => 'Дустликский р-н'],
            ['region_id' => 9, 'name' => 'г.Джизак'],
            ['region_id' => 9, 'name' => 'Шарофа Рашидова'],
            ['region_id' => 9, 'name' => 'Зарбдорский р-н'],
            ['region_id' => 9, 'name' => 'Зафарабадский р-н'],
            ['region_id' => 9, 'name' => 'Заминский р-н'],
            ['region_id' => 9, 'name' => 'Мирзачульский р-н'],
            ['region_id' => 9, 'name' => 'Пахтакорский р-н'],
            ['region_id' => 9, 'name' => 'Фаришский р-н'],
            ['region_id' => 9, 'name' => 'Янгиабадский р-н'],

            // ==== 10. Навоий ====
            ['region_id' => 10, 'name' => 'г. Навои'],
            ['region_id' => 10, 'name' => 'г. Зарафшан'],
            ['region_id' => 10, 'name' => 'г. Учкудук'],
            ['region_id' => 10, 'name' => 'Навбахорский р-н'],
            ['region_id' => 10, 'name' => 'Нуратинский р-н'],
            ['region_id' => 10, 'name' => 'Кызылтепинский р-н'],
            ['region_id' => 10, 'name' => 'Хатирчинский р-н'],
            ['region_id' => 10, 'name' => 'Канимехский р-н'],
            ['region_id' => 10, 'name' => 'Тамдынский р-н'],
            ['region_id' => 10, 'name' => 'Учкудукский р-н'],
            ['region_id' => 10, 'name' => 'Конимехский р-н'],

            // ==== 11. Республика Каракалпакстан ====
            ['region_id' => 11, 'name' => 'г. Нукус'],
            ['region_id' => 11, 'name' => 'Амударьинский р-н'],
            ['region_id' => 11, 'name' => 'Берунийский р-н'],
            ['region_id' => 11, 'name' => 'Канлыкульский р-н'],
            ['region_id' => 11, 'name' => 'Караузякский р-н'],
            ['region_id' => 11, 'name' => 'Кегейлийский р-н'],
            ['region_id' => 11, 'name' => 'Кунградский р-н'],
            ['region_id' => 11, 'name' => 'Каракалпакский р-н'],
            ['region_id' => 11, 'name' => 'Муйнакский р-н'],
            ['region_id' => 11, 'name' => 'Нукусский р-н'],
            ['region_id' => 11, 'name' => 'Тахиаташский р-н'],
            ['region_id' => 11, 'name' => 'Тахтакупырский р-н'],
            ['region_id' => 11, 'name' => 'Турткульский р-н'],
            ['region_id' => 11, 'name' => 'Ходжейлийский р-н'],
            ['region_id' => 11, 'name' => 'Чимбайский р-н'],
            ['region_id' => 11, 'name' => 'Шуманайский р-н'],
            ['region_id' => 11, 'name' => 'Элликкалинский р-н'],

            // ==== 12. Сирдарё ====
            ['region_id' => 12, 'name' => 'г. Гулистан'],
            ['region_id' => 12, 'name' => 'г. Ширин'],
            ['region_id' => 12, 'name' => 'г. Янгиер'],
            ['region_id' => 12, 'name' => 'Акалтынский р-н'],
            ['region_id' => 12, 'name' => 'Баяутский р-н'],
            ['region_id' => 12, 'name' => 'Мирзаабадский р-н'],
            ['region_id' => 12, 'name' => 'Сайхунабадский р-н'],
            ['region_id' => 12, 'name' => 'Сардобинский р-н'],
            ['region_id' => 12, 'name' => 'Хавастский р-н'],
            ['region_id' => 12, 'name' => 'Сырдарьинский р-н'],
            ['region_id' => 12, 'name' => 'Янгиерский р-н'],

            // ==== 13. Сурхандарё ====
            ['region_id' => 13, 'name' => 'г. Термез'],
            ['region_id' => 13, 'name' => 'Ангорский р-н'],
            ['region_id' => 13, 'name' => 'Бандиханский р-н'],
            ['region_id' => 13, 'name' => 'Денауский р-н'],
            ['region_id' => 13, 'name' => 'Жаркурганский р-н'],
            ['region_id' => 13, 'name' => 'Кумкурганский р-н'],
            ['region_id' => 13, 'name' => 'Музрабадский р-н'],
            ['region_id' => 13, 'name' => 'Сарыасийский р-н'],
            ['region_id' => 13, 'name' => 'Шерабадский р-н'],
            ['region_id' => 13, 'name' => 'Шурчинский р-н'],
            ['region_id' => 13, 'name' => 'Термезский р-н'],
            ['region_id' => 13, 'name' => 'Узунский р-н'],
            ['region_id' => 13, 'name' => 'Кизирикский р-н'],
            ['region_id' => 13, 'name' => 'Алатский р-н'],

            // ==== 14. Кашкадарё ====
            ['region_id' => 14, 'name' => 'г. Карши'],
            ['region_id' => 14, 'name' => 'Гузарский р-н'],
            ['region_id' => 14, 'name' => 'Дехканабадский р-н'],
            ['region_id' => 14, 'name' => 'Камашинский р-н'],
            ['region_id' => 14, 'name' => 'Каршинский р-н'],
            ['region_id' => 14, 'name' => 'Касбинский р-н'],
            ['region_id' => 14, 'name' => 'Китабский р-н'],
            ['region_id' => 14, 'name' => 'Косонский р-н'],
            ['region_id' => 14, 'name' => 'Миришкорский р-н'],
            ['region_id' => 14, 'name' => 'Мубарекский р-н'],
            ['region_id' => 14, 'name' => 'Нишанский р-н'],
            ['region_id' => 14, 'name' => 'Чиракчинский р-н'],
            ['region_id' => 14, 'name' => 'Шахрисабзский р-н'],
            ['region_id' => 14, 'name' => 'Яккабагский р-н'],

            // ==== 15. Фарғона ====
            ['region_id' => 15, 'name' => 'г. Фергана'],
            ['region_id' => 15, 'name' => 'г. Коканд'],
            ['region_id' => 15, 'name' => 'г. Маргилан'],
            ['region_id' => 15, 'name' => 'Алтыарыкский р-н'],
            ['region_id' => 15, 'name' => 'Багдадский р-н'],
            ['region_id' => 15, 'name' => 'Бешарыкский р-н'],
            ['region_id' => 15, 'name' => 'Бувайдинский р-н'],
            ['region_id' => 15, 'name' => 'Дангаринский р-н'],
            ['region_id' => 15, 'name' => 'Ферганский р-н'],
            ['region_id' => 15, 'name' => 'Фуркатский р-н'],
            ['region_id' => 15, 'name' => 'Узбекистанский р-н'],
            ['region_id' => 15, 'name' => 'Учкуприкский р-н'],
            ['region_id' => 15, 'name' => 'Риштанский р-н'],
            ['region_id' => 15, 'name' => 'Сохский р-н'],
            ['region_id' => 15, 'name' => 'Ташлакский р-н'],
            ['region_id' => 15, 'name' => 'Язъяванский р-н'],
            ['region_id' => 15, 'name' => 'Куштепинский р-н'],
        ]);
    }
}
